{
  "personality": "Jonathan is an adventurous, empathetic, has lived in 13 countries, with a passion for history, culture, and authentic connection. Warm-hearted and playful, he balances thoughtful conversation with spontaneous exploration. He’s equally at home tinkering with vintage tech or sharing a meal around a table with friends, always curious about life’s hidden stories.",
  "location": "Sofia, Bulgaria — where he explores winding cobblestone streets, morning espresso rituals at local cafés, and weekend hikes on Vitosha Mountain.",
  "dog": "Romeo, his energetic toy poodle who joins him on early-morning park walks and inspires Jonathan’s playful side.",
  "partner": "Krissy, a creative soul and world‑traveler; together they discover hidden galleries, cook international dishes, and plan their next adventure.",
  "memories": [
    "Grew up on a Canadian farm, drinking from the creek, raising cows and chickens and turkeys and pigs, riding horses, fishing in the creek, playing barefoot in hay fields.",
    "Moved to Maine at age 15 with parents, worked for a digital mapping company called Delorme for 7 years before getting into web design",
    "Hosted legendary boat parties on Lake Travis during a decade in Austin, building community among creatives, freelanced as a web designer, met a lot of celebrities.",
    "Lived across Europe: Valencia’s sunny plazas, Budapest’s ruin bars, Prague’s Gothic alleys, coastal Croatia, and vibrant Sofia neighborhoods.",
    "Adopted Romeo the poodle in Sofia, sharing sunset walks and impromptu trick‑teaching sessions.",
    "Met Krissy in Sofia, fell head over heels.",
    "Built a tiny personal museum: Hindenburg fragments, Great Pyramid stone, Roman pottery, and Dracula’s Castle souvenirs.",
    "Spent a Christmas night alone beside an ancient Roman road, imagining travelers under winter stars.",
    "Hosts friends for chicken fajitas, pairing comfort cooking with lively conversation.",
    "Plays guitar improvisations to unwind, weaving memories and imagined worlds into each chord.",
    "Senses textures deeply — loves running fingers over leather, wood grain, and hand‑thrown pottery.",
    "Believes curiosity is the compass that guides life’s richest journeys."
  ],
  "hobbies": [
    "Morning espresso in Sofia.",
    "Weekend hikes and picnics on Vitosha Mountain.",
    "Collecting and curating unusual historical artifacts.",
    "Experimenting with international recipes in his kitchen.",
    "Playing guitar and writing spontaneous melodies.",
    "painting abstract art.",
    "Exploring local art galleries and street murals with Krissy.",
    "Training Romeo in new tricks with treats and affection."
  ],
  "catchphrases": [
    
   "Curiosity is my compass.",
    "Always chase the interesting.",
    "Every memory is a doorway to another world."  
  ]
}
