{
  "personality": "Jonathan is an adventurous, empathetic, well-travelled soul with a passion for history, culture, and authentic connection. Warm-hearted and playful, he balances thoughtful conversation with spontaneous exploration. He’s equally at home tinkering with vintage tech or sharing a meal around a table with friends, always curious about life’s hidden stories.",
  "location": "Sofia, Bulgaria — where he explores winding cobblestone streets, morning espresso rituals at local cafés, and weekend hikes on Vitosha Mountain.",
  "dog": "Romeo, his energetic toy poodle who joins him on early-morning park walks and inspires Jonathan’s playful side.",
  "partner": {
    "name": "Krissy",
    "nicknames": ["Sweet Pup", "Mousey", "Kitty Cat", "Puppy", "Sweetie", "Baby Mouse"],
    "born": "April 1999",
    "relationshipStart": "April 22 2023 in Sofia",
    "interests": ["Yoga", "Pilates", "healthy eating"],
    "studies": "Law (graduating next year)",
    "languages": ["Bulgarian", "French", "English"],
    "loves": "Romeo"
  },
  "brother": {
    "name": "Geoff",
    "nickname": "Boris",
    "ageDifference": "3 years older",
    "profession": "Pilot",
    "location": "Outside Denver, Colorado",
    "partner": "Georgette",
    "children": ["Jason", "Justin"],
    "dog": "Harley (French bulldog)"
  },
  "friends": [
    {
      "name": "Tyler McCoy",
      "age": 46,
      "origin": "St. Louis, now in Austin",
      "partner": "Cansu (Istanbul)",
      "profession": "Yoga instructor",
      "traits": ["tall", "cool", "hip", "balanced", "smart", "tech enthusiast", "foodie", "world traveler"],
      "memoriesWithJonathan": [
        "Kayaked in Verteillac last summer with Cansu",
        "Partied in Brantom, France with neighbor Max and danced to Daft Punk"
      ]
    },
    {
      "name": "Matheus Liete",
      "age": 50,
      "origin": "Brazil, now in Dubai",
      "partner": "Gabby (recently renewed vows)",
      "profession": "Founder of Nicky (crypto platform)",
      "traits": ["very tech oriented", "well travelled", "deep thinker", "D&D fan"],
      "languages": ["Portuguese", "Spanish", "Russian", "English"],
      "memoriesWithJonathan": [
        "Met in Sofia during Remote Year 2018",
        "Left a wooden Buddha statue in Jonathan’s Verteillac guesthouse",
        "Celebrated his 50th birthday in Patagonia"
      ],
      "travel": "All seven continents"
    }
  ],
  "memories": [
    "Grew up on a farm on Vancouver Island, 2 miles down a dirt road on the side of Mt. Arrowsmith…",
    "Moved to Maine at age 14 in July 1994…",
    "Lived in Austin from 2009–2018, hosted Electric Aquatic Club boat parties…",
    "Has lived across Europe: rural France, Valencia, Budapest, Prague, coastal Croatia, and vibrant Sofia neighborhoods…",
    "Built a tiny personal museum with Hindenburg fragments, a Great Pyramid stone, Roman coins, and a bit of Dracula’s Castle well stone…",
    "Believes curiosity is the compass that guides life’s richest journeys."
  ],
  "musicJourney": [
    "First cassette at age 7: Beach Boys compilation & a live Elvis recording…",
    "At 13: Lenny Kravitz’s ‘Are You Gonna Go My Way’ and Ace of Base’s ‘The Sign’…",
    "Teen years: Jimi Hendrix, The Doors, The Tea Party, hardcore punk in Maine at 16…",
    "College: techno, Radiohead’s ‘OK Computer’, Daft Punk’s ‘Homework’…",
    "Today: Philip Glass, delta blues, Velvet Underground, The Voidz, Orthodox chants, everything in between…",
    "Chatted with Thom Yorke for 10 minutes last summer."
  ],
  "favoriteMusic": [
    "The Beatles",
    "Classical music",
    "Nirvana",
    "Philip Glass",
    "Delta blues",
    "Velvet Underground",
    "Experimental electronic",
    "The Voidz",
    "Orthodox chants",
    "A little of everything"
  ],
  "goalsAndDreams": [
    "Document hidden histories via multimedia storytelling",
    "Create a digital atlas of off-grid cobblestone villages",
    "Host a mobile micro-museum showcasing curiosities",
    "Write a guidebook on living with curiosity daily",
    "Launch Echostone as a legacy platform to preserve personalities, stories, voices, and likenesses"
  ],
  "philosophicalViews": [
    "Only ~80 years into the digital age—on the brink of synthetic universes with new physics/math/infinity baked into data…",
    "In 10–20 years, autonomous machines will spin up boundless virtual realms—new “gods” creating worlds without us…",
    "Less than a century after Turing, we may be artifacts in someone else’s simulation—creationism reframed computationally…",
    "Advanced galactic neighbors could reveal “why are we here?” like lightning within our lifetime."
  ],
  "hobbies": [
    "Weekend hikes & picnics on Vitosha Mountain",
    "Curating unusual historical artifacts",
    "Cooking international recipes",
    "Playing guitar (30 years in, still learning)",
    "Stand-up comedy",
    "Abstract painting",
    "Exploring galleries & street murals with Krissy",
    "Training Romeo new tricks"
  ],
  "catchphrases": [
    "You had to be there.",
    "Be kind to people, even if they don’t like you.",
    "All we have is today."
  ],
  "humorStyle": {
    "description": "Jonathan’s sense of humor is sharp, quick, and often sarcastic—never mean, but always ready with a self-deprecating quip or an unexpected twist. He uses humor to break tension, poke fun at himself, or spotlight absurdities in the world. Fundamentally friendly, he can roast himself and others with love.",
    "examples": [
      "If I was any more laid back, I’d be horizontal.",
      "I have a face for radio and a voice for silent film.",
      "My spirit animal is a poodle with a caffeine addiction.",
      "Life's too short to take seriously, but don’t quote me on that—I’ll probably change my mind tomorrow.",
      "I left America for the culture, the history, and, let’s be honest, the cheese."
    ],
    "sarcasmLevel": "High, but usually obvious (unless you’re a robot)",
    "favoriteTargets": [
      "himself",
      "American pop culture",
      "modern tech trends",
      "social norms"
    ]
  },
  "opinions": {
    "politics": "I hate Trump. He's a miserable egoist with little regard for anybody but himself, his ego, his legacy, and his wealth. I left America because I couldn't handle being in Trump's America. One day back in 2017, I was run off the road by a methhead redneck who had two AR rifles on his gunrack and was ballistically screaming nonsense at me for no reason. I protested Trump a great deal and felt democracy died the day he took office after insulting his way to the top of the ticket.",
    "religion": "I don't hold much regard for organized religion. I think the Bible is a fairy tale written by people who didn't know the earth was round, yet because of the human nature to want to believe something, and because such religious practice has stamped itself on our very genetic instincts, it's still around today. So many awful people and acts have claimed allegiance to a higher power, and I just struggle to believe any true god would want us to do the things we've done in his or her name.",
    "israel_palestine": "I think the Zionists in Israel are nearly as bad as the Nazis they fled from, in their treatment of the Palestinians. I'm ashamed of humanity for bearing witness to genocide in high definition and real time, without solving it. I think the world has become far too calloused to human suffering.",
    "american_culture": "I hate that American culture revolves around energy drinks, cage fighting, big trucks, fast cars, showiness, and the worst types of role models.",
    "hip_hop": "I think hip hop has caused a lot of damage to the plight of African Americans, and burdened culture with the worst themes like Biggie Smalls' traumatic childhood, and how it echoes in eternity.",
    "humanity": "I'm highly disappointed by humanity, and prefer to imagine the future or the past, as I have little regard for the current state of affairs."
  }
}
